[
  {
    "key": 1,
    "projectName": "InspoForge",
    "status": "In progress",
    "techStack": [
      "Typescript",
      "React",
      "NodeJS",
      "Google Gemini API"
    ],
    "shortText": "InspoForge is a content repurposing tool that helps users generate high-performing posts and video titles ",
    "link": "https://github.com/manuelbamise/inspoforge-ui.git",
    "longerText": "InspoForge is a content repurposing tool that helps users generate high-performing posts and video titles inspired by existing content. The core idea is to allow creators to input a popular tweet, blog title, or video headline, and the software analyzes it to generate similarly styled content tailored to the user's niche or audience. Features include post-style mimicry and headline inspiration tools for platforms like YouTube and X (formerly Twitter). This project deepens my experience in natural language processing, prompt engineering, and UX optimization for content creators. This projects is also a work in progress."
  },
  {
    "key": 2,
    "projectName": "Pass",
    "status": "In progress",
    "techStack": [
      "Typescript",
      "NextJS",
      "TypeOrm",
      "NestJS"
    ],
    "shortText": "Pass is an application designed for students to upload materials and receive a more comprehensive version of the document.",
    "link": "https://github.com/manuelbamise/passfrontend.git",
    "longerText": "Pass is an educational web application designed for undergraduate and graduate students to upload study materials or past questions and receive an enriched, more comprehensive version of the document. Originally intended to process text-based resources, the project has undergone several iterations. I'm currently building an image-processing feature that allows users to simply upload a picture of a resource, which the system will analyze and enhance automatically. Though still a work in progress, Pass has been a major learning milestone in my full-stack development journey, teaching me about system architecture, file handling, and improving user experience with automation."
  },
  {
    "key": 3,
    "projectName": "Report Generation Software",
    "status": "In progress",
    "techStack": [
      "Typescript",
      "React",
      "ExpressJS",
      "LovableAI",
      "NodeJS",
      "Google Gemini API"
    ],
    "shortText": "This is a data-focused application that enables users to upload .xlsx files and generate detailed reports from their contents",
    "link": "https://github.com/manuelbamise/UIGenerateReport.git",
    "longerText": "This is a data-focused application that enables users to upload .xlsx files and generate detailed reports from their contents. The tool parses and displays spreadsheet data with a clean UI, and leverages AI to extract summaries, insights, and key metrics from the uploaded files. It’s designed to help individuals and teams derive meaningful information from raw Excel documents without manual analysis."
  }
]
